Revit 2024 API
ElectricalSystem.IsCircuitPathValid Method
 Checks whether the list of the electrical system circuit path node position is valid.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsCircuitPathValid(
	IList<XYZ> nodes
)
Visual Basic
Public Function IsCircuitPathValid ( _
	nodes As IList(Of XYZ) _
) As Boolean
Visual C++
public:
bool IsCircuitPathValid(
	IList<XYZ^>^ nodes
)
Parameters
nodes
Type: System.Collections.Generic.IList<XYZ>
 The list of the electrical system circuit path node position.
Remarks
 The length of the list should be more than one, the first node should be the position of the panel where the circuit begins at, the adjacent nodes should not be too close, and should be in the same level or on the same vertical line, to keep each segment of the circuit path always horizontal or vertical.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace